app/controllers/administrador_controller.rb

SELECT "products".* FROM "products"
---
    def stock
        @productos = Product.all