app/controllers/carrito_controller.rb

SELECT "carritos".* FROM "carritos"
---
    def index
        @carrito = Carrito.all