app/controllers/carritos_controller.rb

    def index
        if user_signed_in?
            @usuario = current_user.id
            @carritos = Carrito.where(user_id:current_user.id)
            @orden = Order.new
            @compra = Carrito.delete(user_id:current_user.id)
---
SELECT "carritos".* FROM "carritos" WHERE "carritos"."user_id" = ?  [["user_id", 6]]
DELETE FROM "carritos" WHERE "carritos"."id" = ?  [["id", nil]]

    def show
        if user_signed_in?
            @usuario = current_user.id
            @carritos = Carrito.where(user_id:current_user.id)
            @compra = Carrito.delete(user_id:current_user.id)
---
SELECT "carritos".* FROM "carritos" WHERE "carritos"."user_id" = ?  [["user_id", 2]]
DELETE FROM "carritos" WHERE "carritos"."id" = ?  [["id", 1]]

    def destroy
        @carrito=Carrito.find(params[:id])
        @carros=Carrito.all
        @carrito.destroy
---
SELECT "carritos".* FROM "carritos" WHERE "carritos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "carritos" WHERE "carritos"."id" = ?  [["id", 1]]

    def create
        a=params[:carrito][:id]
        s=params[:carrito][:cantidad]
        @var = Product.where(id:a)
        @var.each do |product|
            @b = product.stock
        end
        k=200
        if @b < s.to_i
            render:stock
        else
        @carrito = Carrito.new(nombre: params[:carrito][:nombre],
                                precio: params[:carrito][:precio],
                                cantidad: params[:carrito][:cantidad],
                                user_id: params[:carrito][:user])
        #EDITAR STOCK DE PRODUCTO LUEGO DE AÑADIR AL CARRITO
            if @carrito.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ?  [["id", 1]]
INSERT INTO "carritos" ("nombre", "precio", "cantidad", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "Leche gloria"], ["precio", 3.5], ["cantidad", 1], ["created_at", "2020-05-01 21:21:01.687131"], ["updated_at", "2020-05-01 21:21:01.687131"], ["user_id", 6]]