app/controllers/carritos_controller.rb

SELECT "carritos".* FROM "carritos"
---
    def index
        @carritos = Carrito.all

INSERT INTO "carritos" ("nombre", "precio", "cantidad", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["nombre", "Leche gloria"], ["precio", 3.5], ["cantidad", 1], ["created_at", "2020-04-29 21:00:16.896963"], ["updated_at", "2020-04-29 21:00:16.896963"], ["user_id", 2]]
---
    def create
        a = params[:carrito][:cantidad].to_f
        b = params[:carrito][:precio]
        @carrito = Carrito.new(nombre: params[:carrito][:nombre],
                                precio: params[:carrito][:precio],
                                cantidad: params[:carrito][:cantidad],
                                user_id: params[:carrito][:user])

        @carrito.save