app/controllers/categoria_controller.rb

SELECT "products".* FROM "products"
---
    def show
        @categoria = Categorium.find(params[:id])
        #@productos = Product.id(params[:id])
        @productos = Product.all