app/controllers/categorias_controller.rb

    def show
        @categoria = Categorium.find(params[:id])
        #@productos = Product.id(params[:id])
        @productos = Product.where(id:params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."categoria_id" = ?  [["categoria_id", 1]]