app/controllers/orders_controller.rb

INSERT INTO "orders" ("nombre", "precio", "cantidad", "fecha", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @order = Order.new(nombre: params[:order][:nombre],
                                precio: params[:order][:precio],
                                cantidad: params[:order][:cantidad],
                                user_id: params[:order][:user_id],
                                fecha: params[:order][:time])
        @order.save

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = ?  [["user_id", 6]]
---
    def show
        @ordenes=Order.where(user_id:current_user.id)