app/controllers/products_controller.rb

    def index
        @producto = Product.new
        @productos = Product.all
---
SELECT "products".* FROM "products"

    def show
        @producto = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        @producto = Product.new(nombre: params[:product][:nombre],
                                    descripcion: params[:product][:descripcion],
                                    precio: params[:product][:precio],
                                    stock: params[:product][:stock],
                                    urlimagen: params[:product][:urlimagen],
                                    categoria: params[:product][:categoria])
        @producto.save
---
INSERT INTO "products" ("nombre", "descripcion", "urlimagen", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nombre", ""], ["descripcion", ""], ["urlimagen", ""], ["created_at", "2020-04-30 01:58:57.121693"], ["updated_at", "2020-04-30 01:58:57.121693"]]