app/controllers/productos_controller.rb

    def index
        @productos = Product.all
---
SELECT "products".* FROM "products"

    def show
        @producto = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]