app/controllers/shared_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
    def perfil
        @usuario = User.where(id:current_user.id)