app/controllers/shared_controller.rb

SELECT "users".* FROM "users"
---
    def perfil
        @usuario = User.all