app/views/layouts/application.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
        <% if user_signed_in? %>
        <% @usuario = User.where(id:current_user.id) %>